Repository: yaxsq/cs7-hci
Catalog: lib/l10n/app_*.arb
Languages: ur

source: DELIVER TO
ur: ڈیلیور کریں

# deliveryAddress
source: 123 Main St, Anytown
ur: 123 مین اسٹریٹ، کوئی بھی شہر

# searchHint
source: Search for groceries
ur: گروسری تلاش کریں

source: All
ur: سب

source: Fruits
ur: پھل

source: Dairy
ur: دودھ

source: Bakery
ur: بیکری

source: Vegetables
ur: سبزیاں

source: Meat
ur: گوشت

source: Weekly Deals
ur: ہفتہ وار سودے

source: See All
ur: سب دیکھیں

source: Fresh Produce
ur: تازہ پیداوار

# summerBBQ
source: Summer BBQ Essentials
ur: موسم گرما کے باربی کیو لوازمات

# grillingSeason
source: Get ready for grilling season!
ur: گرلنگ سیزن کے لیے تیار ہو جائیں!

source: Accessibility Menu
ur: رسائی مینو

source: Larger Font
ur: بڑا فونٹ

source: High Contrast
ur: ہائی کنٹراسٹ

source: Narrator
ur: راوی

source: Urdu
ur: اردو

# continueButton
source: Continue
ur: جاری رکھیں

source: My Cart
ur: میری کارٹ

source: Subtotal
ur: ذیلی کل

source: Delivery Fee
ur: ڈیلیوری فیس

source: Total
ur: کل

source: Proceed to Checkout
ur: چیک آؤٹ پر آگے بڑھیں

source: Continue Shopping
ur: خریداری جاری رکھیں

source: Checkout
ur: چیک آؤٹ

source: Address
ur: پتہ

source: Payment
ur: ادائیگی

source: Review
ur: جائزہ

source: Select Delivery Address
ur: ڈیلیوری کا پتہ منتخب کریں

source: Home
ur: گھر

# homeAddress
source: 123 Main St, Anytown, USA
ur: 123 مین اسٹریٹ، کوئی بھی شہر، امریکہ

source: Work
ur: کام

# workAddress
source: 456 Oak Ave, Sometown, USA
ur: 456 اوک ایو، کوئی شہر، امریکہ

source: Add New Address
ur: نیا پتہ شامل کریں

source: Select Payment Method
ur: ادائیگی کا طریقہ منتخب کریں

source: Credit Card
ur: کریڈٹ کارڈ

source: PayPal
ur: پے پال

source: Review Your Order
ur: اپنے آرڈر کا جائزہ لیں

# quantityShort
source: Qty: {quantity}
ur: مقدار: {quantity}

source: BACK
ur: پیچھے

source: PLACE ORDER
ur: آرڈر دیں

# continueText
source: CONTINUE
ur: جاری رکھیں

source: Order placed successfully!
ur: آرڈر کامیابی سے دے دیا گیا!

source: Quantity
ur: مقدار

source: Product Details
ur: مصنوعات کی تفصیلات

source: Nutritional Facts
ur: غذائی حقائق

# nutritionalFactsContent
source: Calories: 150, Fat: 10g, Protein: 5g, Carbs: 10g
ur: کیلوریز: 150، چکنائی: 10 گرام، پروٹین: 5 گرام، کاربوہائیڈریٹ: 10 گرام

source: Add to Cart
ur: کارٹ میں شامل کریں

# itemAddedToCart
source: {itemName} (x{quantity}) added to cart!
ur: {itemName} (x{quantity}) کارٹ میں شامل کر دیا گیا!

source: Recent Searches
ur: حالیہ تلاشیں

source: Popular Items
ur: مشہور اشیاء

source: Organic Milk
ur: نامیاتی دودھ

source: Fresh Berries
ur: تازہ بیر

source: Cheddar Cheese
ur: چیڈر پنیر

# homeNav
source: Home
ur: گھر

# browseNav
source: Browse
ur: براؤز کریں

# cartNav
source: Cart
ur: کارٹ

# accountNav
source: Account
ur: اکاؤنٹ

# accountTitle
source: Account
ur: اکاؤنٹ

# userName
source: Syed Rafay Ahmed
ur: سید رفیع احمد

source: Order History
ur: آرڈر کی تاریخ

# deliveryAddressTitle
source: Delivery Address
ur: ڈیلیوری کا پتہ

# deliveryAddressContent
source: Jane Doe\n2464 Royal Ln. Mesa, New Jersey 45463
ur: جین ڈو\n2464 رائل لین۔ میسا، نیو جرسی 45463

# emailTitle
source: Email
ur: ای میل

# phoneNumberTitle
source: Phone Number
ur: فون نمبر

source: Track Order
ur: آرڈر ٹریک کریں

source: Change
ur: تبدیل کریں

source: Set delivery location
ur: ڈیلیوری کا مقام مقرر کریں

source: Your Location
ur: آپ کا مقام

# defaultLocation
source: 123 Market Street, Downtown
ur: 123 مارکیٹ اسٹریٹ، ڈاؤن ٹاؤن

source: Confirm Location
ur: مقام کی تصدیق کریں

source: Track My Order
ur: میرا آرڈر ٹریک کریں

# orderOnItsWay
source: Your order is on its way!
ur: آپ کا آرڈر راستے میں ہے!

source: Add
ur: شامل کریں

# productName_1
source: Organic Eggs
ur: نامیاتی انڈے

# productDescription_1
source: A dozen of our finest organic eggs.
ur: ہمارے بہترین نامیاتی انڈوں کا ایک درجن۔

# productName_2
source: Bread
ur: روٹی

# productDescription_2
source: Freshly baked bread.
ur: تازہ پکی ہوئی روٹی۔

# productName_3
source: Organic Milk
ur: نامیاتی دودھ

# productDescription_3
source: A gallon of fresh organic milk.
ur: تازہ نامیاتی دودھ کا ایک گیلن۔

# productName_4
source: Cheddar Cheese
ur: چیڈر پنیر

# productDescription_4
source: A block of sharp cheddar cheese.
ur: تیز چیڈر پنیر کا ایک بلاک۔

# productName_5
source: Avocados
ur: ایوکاڈو

# productDescription_5
source: A bag of ripe avocados.
ur: پکے ہوئے ایوکاڈو کا ایک بیگ۔

# productName_6
source: Bananas
ur: کیلے

# productDescription_6
source: A bunch of sweet bananas.
ur: میٹھے کیلوں کا ایک گچھا۔

# productName_7
source: Strawberries
ur: اسٹرابیری

# productDescription_7
source: A punnet of fresh strawberries.
ur: تازہ اسٹرابیری کا ایک پنیٹ۔

# productName_8
source: Broccoli
ur: بروکولی

# productDescription_8
source: Fresh broccoli florets.
ur: تازہ بروکولی کے پھول۔

# productName_9
source: Apples
ur: سیب

# productDescription_9
source: Crisp red apples.
ur: کرسپی سرخ سیب۔
